<script setup>
import Header from '@/components/Header/Header.vue'
import Footer from "@/components/Footer/Footer.vue";
import { ref } from 'vue';
import { ElTreeV2 } from 'element-plus';
var query = ref('');
var treeRef = ref(null);
var props = {
  value: 'id',
  label: 'label',
  children: 'children'
};
const data = [
  {
    id: 1,
    label: '北京市',
  },
  {
    id: 2,
    label: '上海市',
  },
  {
    id: 3,
    label: '天津市',
  },
  {
    id: 4,
    label: '重庆市',
  },
  {
    id: 5,
    label: '河北省',
  },
  {
    id: 6,
    label: '山西省',
  },
  {
    id: 7,
    label: '内蒙古自治区',
  },
  {
    id: 8,
    label: '江苏省',
  },
  {
    id: 9,
    label: '浙江省',
  },
  {
    id: 10,
    label: '安徽省',
  },
  {
    id: 11,
    label: '福建省',
  },
  {
    id: 12,
    label: '江西省',
  },
  {
    id: 13,
    label: '山东省',
  },
  {
    id: 14,
    label: '河南省',
  },
  {
    id: 15,
    label: '湖北省',
  },
  {
    id: 16,
    label: '湖南省',
  },
  {
    id: 17,
    label: '广东省',
  },
  {
    id: 18,
    label: '海南省',
  },
  {
    id: 19,
    label: '四川省',
  },
  {
    id: 20,
    label: '贵州省',
  },
  {
    id: 21,
    label: '云南省',
  },
  {
    id: 22,
    label: '陕西省',
  },
  {
    id: 23,
    label: '甘肃省',
  },
  {
    id: 24,
    label: '青海省',
  },
  {
    id: 25,
    label: '西藏自治区',
  },
  {
    id: 26,
    label: '新疆维吾尔自治区',
  },
  {
    id: 27,
    label: '宁夏回族自治区',
  },
  {
    id: 28,
    label: '广西壮族自治区',
  },
  {
    id: 29,
    label: '辽宁省',
  },
  {
    id: 30,
    label: '吉林省',
  },
  {
    id: 31,
    label: '黑龙江省',
  },
  {
    id: 32,
    label: '陕西省',
  },
]
const dataResource = [
  { title: '苗族栽岩习俗', content: '苗族栽岩是由苗族民间实施习惯法而产生的习俗。苗族议榔制是历史上苗族社会组织的一种，议榔制可以由一个鼓社、一个寨或几个寨，乃至整个地区组成，苗族习惯法称为“议榔规约”。每次议榔会议前，先由寨头们商议议榔内容，然后召开群众大会，宣布议定的议榔规约，由大会通过。有的议榔后在会址竖石一块，表示习惯法坚如磐石，不可更改。议榔栽岩是苗族的口碑条款规约，在苗族社会里有悠久的历史，是私有制社会以后出现的，规范人们行为的产物，有很强的法律约束力。 议榔的目的是维护人们正常的生产和生活，表现形式是用赌咒的方式来颁布条款、规约。条款、规约颁布以后，靠赌咒的“魔力”和寨老以及群众的互相影响、互相制约、互相监督等来完成条款规约的实施。岩是规约的载体，过去栽的岩无文字，规约和款项自议榔师向族人、寨老或群体宣布通过，规约就自然保存于人们的头脑中，以后有触犯相关规约的事件案件，族老或寨民就以案件轻重罚相关的银两，重者都是以杀头修榔。 议榔栽岩有一寨的议榔，有数寨联合的议榔，有区域性或族群的议榔等。议榔栽岩还有多人的议榔，也有个人议榔；有关于习俗、友谊、防护的议榔，也有驱邪、划分界线等的议榔。以某一寨议榔的如摆贝寨头的议榔栽岩；数寨议榔的如高趴的议榔栽岩和高武飞山庙的《榔规》碑以及高懂的离婚岩；区域性议榔的如古歌唱的“阵林五果”栽岩、“摆也应利”栽岩和五公栽岩等。 议榔栽岩除其自身的法律作用外，对研究苗族历史也有很大的帮助，因为苗族过去没有自己的文字，苗族历史和许多优秀文化只能在古歌或习俗上体现。议榔栽岩古歌传唱远古，目前，苗族栽岩古歌在榕江境内许多老人中保存较好，歌词传唱久远，涉及的地名也多，唱到榕江之后才隐约对应到现在的地址。榕江之前找不到，只在古歌里提起，但不知是什么地方。 议榔栽岩为苗族社会的和谐稳定，促进苗族社会的发展，起到重要的作用。 ', footer: '申报地区或单位：贵州省榕江县' },
  { title: '装泥鱼习俗', content: '装泥鱼是广东珠海市斗门区乾务镇极富地方特色的一项传统技艺，最早起源于清乾隆三十年（1765），在虎山村、荔山村、马山村、网山村、大海环村、石狗村尤为兴盛，至今已有二百四十多年的历史。 斗门区乾务镇地处广东省珠海市西部，濒临南海，属滨海大沙田地区。这里水网交错，气候温和，盛产泥鱼、沙虾、青蟹等种类繁多的水产品，六百多年来一直享有珠江口西岸“鱼米之乡”的盛名。它的西南面有一片咸淡水交界的黄茅海水域，海水咸度仅为3‰，是典型的低盐度地区，这里滩涂面积达三万多亩，生长着大量藻类植物，腐植质丰富，为泥鱼生长提供了独有的、必不可少的水质条件和食物来源。 清同治十二年出版的《香山县志》（本衙藏版）卷十四中记载：“弹流鱼即田流鱼，一名花鱼，一名七星鱼。色灰黑，长三四寸，身有花点，肉嫩，味清美，可作羹。”因为花鱼颜色与泥土相近，村民们习惯把它叫做泥鱼。 装泥鱼技艺主要有制作渔笼、制作渔篓、制作泥板、捕捉泥鱼四道主要程序，具有地域性、独创性、实用性和性别差异性的特点。这一传统技艺祖祖辈辈相传至今，家喻户晓，生动地记载了一个地域活态的传统技艺发展历史，对它予以抢救性的保护和传承，具有非常重要的意义。 ', footer: '申报地区或单位：广东省珠海市斗门区' },
  { title: '径山茶宴', content: '径山茶宴是杭州市余杭区径山万寿禅寺接待贵客上宾时的一种大堂茶会，是独特的以茶敬客的庄重传统茶宴礼仪习俗，是中国古代茶宴礼俗的存续。径山茶宴起源于唐朝中期，《余杭县志》有唐朝径山寺开山祖师法钦“佛供茶”条目，盛行于宋元时期，后流传至日本，成为日本茶道之源。 按照寺里传统，每当贵客光临，住持就在明月堂举办茶宴招待客人。径山茶宴从张茶榜、击茶鼓、恭请入堂、上香礼佛、煎汤点茶、行盏分茶、说偈吃茶到谢茶退堂，有十多道仪式程序，宾主或师徒之间用“参话头”的形式问答交谈，机锋偈语，慧光灵现。以茶参禅问道，是径山茶宴的精髓和核心。 径山茶宴堂设古雅，程式规范，主躬客庄，礼仪备至，依时如法，和洽圆融，蕴涵丰富，体现了禅院清规和礼仪、茶艺的完美结合，具有品格高古、清雅绝伦的独特风格，堪称中国禅茶文化的经典样式。 径山茶宴具有悠久的历史价值和丰富的文化内涵，以茶论道，禅茶一味，体现了中国禅茶文化的精神品格，丰富并提升了中国茶文化的内涵，具有学术研究价值。径山茶宴是日本茶道的渊源，对中日文化交流起到桥梁和纽带作用。径山茶宴对于近代“茶话会”礼仪的形成，对杭州地区民间饮茶礼仪习俗的存续都有重要影响，民俗学价值突出。 ', footer: '申报地区或单位：浙江省杭州市余杭区' },
  { title: '月也', content: '月也，侗语意为“集体出访做客”，当地汉族称为“吃乡思”、“吃乡食”，一般在农历正月和八月举行，是侗族传统交际联谊活动。拦路歌，侗族迎客送客时唱的歌，多用于“月也”场合。“月也”时间长短由内容决定，参加人数一般是一家一名代表。由寨中有威望的人率领，集体到某友好村寨拜访。甲寨客人快到乙寨时，乙寨众人要到寨口迎接，同时用日常生产工具或生活用具等，设置重重路障，双方摆开歌阵，对唱拦路歌。主队用歌提问，客队用歌回答，答对一次撤除一个路障。如答错，客队就燃放鞭炮，表示歉意和敬意，主队就尽撤路障，迎客入寨，参加丰富多彩的联欢活动，如演侗戏、唱侗歌、舞龙舞狮、赛芦笙，等等。月也结束，主寨又集结队伍欢送客人，送至寨口又唱拦路歌，表示挽留。彼此别情依依，表现了同胞之间的团结友爱情谊。 月也流传于贵州省黎平、从江、榕江及广西三江侗族自治县广大侗族地区。侗族“月也”习俗一般在秋后或春节间的农闲时节举行。月也活动规模盛大，侗寨男女老幼都身着节日盛装参加，寨中“歌队”、“芦笙队”和戏班子一同参与。期间，宾主白天或演侗戏，或赛芦笙，或踩歌堂；晚上则到鼓楼对唱大歌，或欣赏“嘎锦”（侗族曲艺）直到深夜；之后，两寨青年男女还要到月堂里行歌坐夜直至天亮。而从客人来到主寨当天，侗族独特的拦路迎宾、吹笙迎客、请“萨”进堂、唱歌敬酒、抬官人、打花脸等各项民俗活动伴随着各项文化展示而同时呈现。宾主如此欢度三至五日始散。离别时，主寨还要以猪羊馈赠。视收成情况，次年或若干年后，此寨再到彼寨回访。 在侗族月也习俗中，集体做客是活动的平台，文化展示是活动的内容，情感交流是活动的目的。从文化角度来说，月也习俗是侗人以独特的形式展示和传承自己的文化，增强本民族文化认同的重要方式，是文化交流最重要的途径，它是侗族文化得以生存的土壤。通过月也活动，侗民族增进了感情，加强了团结，缔结了友谊，构建了和谐社会。 ', footer: '申报地区或单位：贵州省黎平县' },
  { title: '网船会', content: '网船会是流行于浙江省嘉兴市秀洲区王江泾镇民主村的渔民水上庙会。每年清明、中秋、除夕举行三期庙会。届时，江浙沪一带渔民、船民数万人，纷纷驾船前来赶庙会，船只汇集荡面，不下数千艘，蔚为壮观。 庙会的祭祀主神叫“刘猛将”。传说为元代灭蝗将军刘承宗。当地有刘王庙，主祀刘猛将。历史上，中国农民为抵御蝗灾而形成的“蝗神信仰”分布极广，历时久远，如今大多已衰落，嘉兴网船会堪称研究古代虫灾史的“活化石”，具有极高的史料价值。 百余年来，网船会在当地已衍变为渔民、船民的节日。赴会者高举会社的大旗，除祭祀神灵外，还有认祖归宗、联络感情的重要文化功能。民主村莲泗荡位于京杭大运河南段，网船会赴会民众均与运河水系有关。在运河水系长年漂泊劳作的渔民、船民大多有一定的家族和民间结社等社会组织，平时鲜有见面和交流机会，全靠每年三次的网船会联络感情。庙会期间，各地渔民、船民自发表演宝卷、神歌、龙舞、狮舞、莲湘、挑花篮、荡湖船、高跷、大纛旗、清音班、抬轿、腰鼓、戏文、踏白船、扎肉提香等原生态民族民间艺术，前后持续一周左右，人山人海，热闹非凡。 在现代化进程中，网船会面临种种尴尬。一方面陆路交通正在逐渐取代水路，赴庙会的农民、市民往往乘车前往，与网船会本意并不协调；另一方面水上交管部门又出于水上安全考虑，在庙会期间往往实行交通管制，致使网船会的特征正在发生嬗变，亟待采取必要措施，加强保护。 ', footer: '申报地区或单位：浙江省嘉兴市秀洲区' },
  { title: '独辕四景车赛会', content: '独辕四景车大赛会形成于山西长治市平顺县，是广泛流行于平顺及周边区县的特色独具又影响较大的社火活动。 独辕四景车大赛会盛行于清朝。清朝咸丰年间岁贡牛联奎老先生作诗盛赞：“四景神车不计年，八村五社会流传。赛期例卜三春幕，宴酒先尝二月天。廿四马楼排列后，几重社鼓引当前。东下南北西流转，崇奉丹宵太乙仙。”诗中反映了当地四景车活动的盛况。1938年因日军侵华曾一度中断。2005年农历四月初四，中断了66年的九天圣母庙大赛会复会，四景车盛景重现。 四景车的所谓“四景”，并不是车本身的四种景致，而是车本身结构有四处巧妙的设计。第一，偌大的一辆彩车，只置一根独猿，却用两头牛驾驭；第二，用三根约90厘米长，直径6厘米粗，新砍下的湿榆木棒做成的木犋，用连环套的方法套上去，既可随意活动，又不会脱辕；第三，十多米高的彩车，仅绕中心木架的四只架脚直立在底平板上，不开榫铆，只用8根麻绳紧扎牢固；第四，彩车第二、三节是中心主架，头对头相接，四面用4根麻绳紧固在一起。整个四景车，不用一个榫眼、一颗钉子，全是麻绳紧扎。大赛会上，除四景车外，还有神驾、神楼、旗牌、伞、纲、彩童、锣、鼓、乐队等等，举不胜举。 四景车从东河九天圣母庙到主会场（圆心地）相距约5公里，中间还要经过约50米长、45度的土坡，其路程之远、坡度之大给跑车带来一定的难度。但从来没有听人说过在历年大赛会中发生过翻车事故。由于四景奇特，沿途观者甚众，是否参加过大赛会、是否观看过四景车，成为当地人的一种资历、一种荣耀。所以，民间至今仍流传“赶了大赛会，死了不后悔”的谚语。 四景车是中华民族文化灿烂之奇葩，历经千年，仍闪烁煜煜光华。作为中华民族文化遗产，四景车精巧的构造艺术、精美的外观设计、独特的民俗民韵、深邃的文化内涵、高超的驾车技艺，都彰显出中华民族传统文化生命力的独特价值。 ', footer: '申报地区或单位：山西省平顺县' },
  { title: '尉村跑鼓车', content: '尉村跑鼓车是为纪念唐代名将尉迟恭而举行的一种集祈福与健身为一体的影响较大的民俗活动。源于山西省汾城镇尉村，广泛流行于山西省襄汾县西部。 “跑鼓车”活动主要包括三大部分：祭鼓、踩辕和赛鼓。 祭鼓：每年农历正月十三和三月十三为祭鼓的日子。过去在尉迟恭祠前祭鼓，现在因该祠已毁，改在村中大庙里进行。由老者主持，祈求风调雨顺，百姓平安。 踩辕：鼓车祭祀完之后，由二十余名村民拉着游街，德高望重者身披绶带，踩在车上，是一种至高无上的荣誉。 赛鼓：全村按居住方位分为西北院、西边院、东院、庙巷、南院、后院6个院，每个院都有自己的鼓车。比赛时可以相互邀请，两辆鼓车进行比赛，是村民强身健体、增进友谊的一项重要活动。外村来拉鼓车者，也要根据居住方位选择鼓车，不得随意。 村里专门有“鼓车田”，每个鼓车3—4亩，谁耕种，来年拉鼓车的费用就由他来出。由自古就有的“鼓车协会”，负责有关事宜。 参加比赛的队员奋力拉车，亲戚朋友呐喊助威。妇女炸油糕熬热汤送到赛场，气氛十分热烈。近年来，妇女们也加入了“跑鼓车”的行列，妇女在赛场上的精彩表现，更使人耳目一新。 比赛时，伴随着飞奔的鼓车，两名乐师站在车上击鼓敲锣，由鼓锣声组成的鼓乐，激扬清脆，是古代击鼓进军鼓乐的活化石。 尉村尉迟恭“跑鼓车”这项淳朴、积极向上、历史悠久的民俗活动具有鲜明的地方文化特色，具有重要的民俗学价值。 ', footer: '申报地区或单位：山西省襄汾县' },
  { title: '塔吉克族服饰', content: '塔吉克族服饰在中国少数民族服饰文化中特色鲜明。据玄奘《大唐西域记》记载：朅盘陀国王族的相貌、服饰“貌同中国，首饰方冠，身衣胡服”。正反映出古代塔吉克族服饰的特点。 塔吉克服饰与其生活的环境有密切的关系，服饰包括男式、女式和儿童三种，有帽（单帽、皮帽）、头巾、外衣、裤子（皮、棉、单）、裙子（布、绸、缎）、腰带、毡靴、皮靴以及妇女的首饰等。 由于长年生活在帕米尔高原，塔吉克族服装主要以棉、皮衣和夹衣为主，没有明显的四季服装。但是服饰的皮、毛、布、绸、绒、丝等多种原阿合奇县节庆活动时，百余名猎鹰者入场场景。 料的选择和服饰图案的运用布局、色彩的搭配，以及妇女服饰的设计、首饰的造型和佩戴，都反映了塔吉克族的审美情趣和审美心理，反映了民族的特征和民族的性格，具有较深的文化内涵。 塔吉克族的服饰具有明显的民族特色，颜色鲜艳，色彩丰富，与他们生活的环境形成了鲜明的对比。在色彩的运用上十分大胆，对比强烈，具有视觉的冲击力；在造型上和式样上，又显得别致而富有美感。 塔吉克族服饰在表现性别、年龄、已婚和未婚上都有明显的区别。妇女的服饰多以红色为主，显得艳丽；男式服饰主要以黑色和较深的颜色为主，显得庄重。 塔吉克族是中国人口较少的民族之一，服饰款式独特，色彩华丽，具有鲜明的民族特点，这在中国少数民族中具有一定的代表性。对研究中国少数民族的服饰文化、服饰发展史有一定的价值。 随着交通的发展和服装市场的繁荣，形式多样、穿戴方便、价格低廉的现代服装越来越受到塔吉克人的青睐，而价格昂贵、制作繁琐、穿戴不便的传统服饰，渐渐被淘汰，会制作塔吉克族传统服装的人越来越少，传统服饰的制作显得后继无人。塔吉克族传统的民族服饰面临濒危境地。', footer: '申报地区或单位：新疆维吾尔自治区塔什库尔干塔吉克自治县' },
  { title: '柯尔克孜族驯鹰习俗', content: '驯鹰习俗是柯尔克孜族长期以来形成的一种生产生活习俗，也是游牧民族的主要生活习俗。捕获猎鹰是驯鹰习俗的开始。 为了消除鹰的野性，牧民们一般使用“熬鹰”的方法，就是蒙上鹰眼，把它放在一根横吊在空中的木棍上，来回晃动木棍，使鹰无法稳定地站立，消除鹰的自然野性。“熬鹰”过后还要“养鹰”，养鹰也有一套方法，驯鹰人把肉放在手臂的皮套上，让鹰前来啄食，同时调训其从空中俯冲捕食的能力。 鹰的寿命大约在40—50年间，柯尔克孜族人一般将一只鹰人工驯养5—7年后就必须放归大自然，让其繁衍后代。 驯鹰作为柯尔克孜族的生活习俗，在过去的游牧生活中起到了捕食的重要作用，现在政府极力改善农牧民的生活现状，在全县各乡镇大力推广牧民定居和抗震安居房，必将对柯尔克孜族的游牧生活产生影响，加之鹰是国家二级保护动物，也不允许随意抓捕，同时现代的狩猎手段也产生了极大的变化，都与驯鹰这一传统民族习俗有冲突，导致这一传统生活习俗濒临失传。', footer: '申报地区或单位：新疆维吾尔自治区阿合奇县' },


];
var onQueryChanged = function (query) {
  treeRef.value.filter(query);
};
var filterMethod = function (query, node) {
  return node.label.includes(query);
};
</script>
<template>
  <div class="article-container">
    <!-- 页面导航条 -->
    <div>
      <Header></Header>
    </div>
    <!-- 页面内容 -->
    <div class="article-body">
      <!-- 左侧目录树 -->
      <div class="article-body-left">
        <el-input v-model="query" class="article-body-left-search" placeholder="请输入关键词" @input="onQueryChanged" />
        <el-tree-v2 ref="treeRef" class="article-body-left-tree" :data="data" :props="props" :height="680"
          :expand-on-click-node="false" :filter-method="filterMethod" />
      </div>
      <!-- 右侧展示区 -->
      <div class="article-body-right">
        <el-scrollbar height="750px">
          <el-card v-for="(item, index) in dataResource" :key="index" class="scrollbar-demo-item">
            <template #header>
              <div class="card-header">
                <span>{{ item.title }}</span>
              </div>
            </template>
            <div class="card-content">{{ item.content }}</div>
            <template #footer>
              <div class="card-footer">{{ item.footer }}</div>
            </template>
          </el-card>
        </el-scrollbar>
      </div>
    </div>
    <!-- 页脚 -->
    <div id="sticky-footer">
      <Footer style="background-color: #475669;"></Footer>
    </div>
  </div>
</template>
<style scoped>
.article-container {
  display: flex;
  flex-direction: column;
  background-color: #475669;
  height: 100vh;
  overflow: hidden;
}

.article-body {
  margin-top: 58px;
  height: calc(100vh - 58px);
  display: flex;
  flex-direction: row;
  overflow: hidden;
}

.article-body-left {
  width: 300px;
  margin-top: 15px;
  margin-left: 15px;
}

.article-body-left-search {
  margin-bottom: 15px;
  width: 100%;
}

.article-body-left-tree {
  height: 680px;
  overflow: hidden;
  border-radius: 8px;
  font-size: 18px;
  font-weight: 500;
  font-family: 微软雅黑, serif;
  color: black;
  line-height: auto;
}

.article-body-right {
  margin-top: 15px;
  margin-left: 5px;
  border-radius: 4px;
  flex: 1;
  overflow: hidden;
}

.scrollbar-demo-item {
  margin: 15px;
  border-radius: 4px;
  color: var(--el-color-primary);
}

.card-header {
  font-size: 22px;
  font-weight: 700;
  line-height: 24px;
  letter-spacing: 2px;
  color: #000;
}

.card-content {
  display: block;
  height: auto;
  width: auto;
  font-family: 微软雅黑, serif;
  font-size: 16.8px;
  line-height: 24px;
  letter-spacing: 2px;
  text-align: left;
  text-size-adjust: 100%;
  color: rgb(37, 122, 219);
}

.card-footer {
  font-size: 15px;
  line-height: 24px;
  letter-spacing: 2px;
  color: #171616;
}

#sticky-footer {
  position: absolute;
  bottom: 0;
  width: 100%;
}
</style>